Catalogs/ВариантыАнализаЦелевыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВариантыАнализаЦелевыхПоказателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СтруктураЦелей</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОтображенияПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтображенияВариантовАнализа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериодаАктуальностиРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодовАктуальностиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьНоль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьМаркерТочекПрогноза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьМаркерыТочек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПодписиКДиаграммам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьМаксимальноеЗначениеДляПокомпонентногоСравнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаАнализаПрогноза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоризонтПрогноза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрадиентДляПокомпонентногоСравнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеАнализа</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеАнализаДополнительное</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьЗначений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПредставленияЧисел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодРасчетаЗначений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыРасчетаВариантовАнализаЦелевыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАнализа</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкантовкаДиаграмм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьЛегенду</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодАктуальностиРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодАнализа</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьРасчетаПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодСравнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПрогноз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПокомпонентногоСравнения</Name>
					<Comment>0 - сравнение объектов анализа, 1 - сравнение с доп.значением</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСглаживанияДиаграмм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимШкалыЗначений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимШкалыЗначенийДиаграмм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАнализа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыАнализаПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДиаграммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДиаграммПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЦветОсновнойСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьРасчетаДробнойЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДемонстрационныхДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПользовательскихНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтображения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОтображенияВариантовАнализа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетыДляРасшифровки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтруктураЦелей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтруктураЦелей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияЦели</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЦелей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельИзмеримая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевойПоказатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименованиеЦелевогоПоказателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеСхемыКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размерность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевойТренд</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦелевыхТрендовПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочиванияИерархического</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВариантыАнализаЦелевыхПоказателей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	ПриЧтенииСозданииНаСервере();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СохранитьНастройкиСКДВариантаАнализа(ТекущийОбъект);
	
	ТекущийОбъект.ПериодАнализа = Новый ХранилищеЗначения(ПериодАнализа);
	
	ТекущийОбъект.ПериодСравнения = Новый ХранилищеЗначения(ПериодСравнения);
	
	ТекущийОбъект.ХранилищеНастроекОформления = ХранилищеНастроекОформления;

	ТекущийОбъект.ХранилищеДемонстрационныхДанных = ХранилищеДемонстрационныхДанных;
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Элементы.ПериодСравнения.АвтоОтметкаНезаполненного
		И НЕ ЗначениеЗаполнено(ПериодСравнения) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Период сравнения"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,, "ПериодСравнения",, Отказ);
	КонецЕсли;
	
	Если Элементы.ОбъектАнализа.АвтоОтметкаНезаполненного
		И ОбъектАнализа = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Объект анализа"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,, "ОбъектАнализа",, Отказ);
	КонецЕсли;
	
	Если Элементы.ЗначениеАнализа.АвтоОтметкаНезаполненного
		И ЗначениеАнализа = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Значение"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,, "ЗначениеАнализа",, Отказ);
		КонецЕсли;
		
	Если Элементы.ЗначениеАнализаДополнительное.АвтоОтметкаНезаполненного
		И ЗначениеАнализаДополнительное = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Доп. значение"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,, "ЗначениеАнализаДополнительное",, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГлубинаАнализаПрогнозаПриИзменении(Элемент)
	УстановитьНадписиКПолямПериодов(Объект, Элементы);
КонецПроцедуры

&НаКлиенте
Процедура ГоризонтПрогнозаПриИзменении(Элемент)
	УстановитьНадписиКПолямПериодов(Объект, Элементы);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеАнализаПриИзменении(Элемент)
	Если ЗначениеАнализа = ЗначениеАнализаДополнительное Тогда
		ЗначениеАнализаДополнительное = Неопределено;
	КонецЕсли;
	ЗаполнитьСписокВыбораЗначенийАнализа();
	
	УстановитьДоступностьЗаполненияПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура РежимПокомпонентногоСравненияПриИзменении(Элемент)
	Если Объект.РежимПокомпонентногоСравнения = 0 Тогда
		ЗначениеАнализаДополнительное = Неопределено;
	Иначе
		ОбъектАнализа = Неопределено;
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементовСравнения(Объект, Элементы, Истина);
КонецПроцедуры

&НаКлиенте
Процедура МетодРасчетаЗначенийПриИзменении(Элемент)
	УстановитьДоступностьЗаполненияПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАнализаПриИзменении(Элемент)
	УстановитьДоступностьЗаполненияПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ОтборПоПользователю = Новый Структура("Пользователь", Объект.Ответственный);
	
	Если Не Объект.Ответственный.Пустая() Тогда
		Если Объект.НастройкиДоступности.НайтиСтроки(ОтборПоПользователю).Количество() = 0 Тогда
			СтрокаВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Сделать доступным вариант анализа для %1?'"),
				Объект.Ответственный); 
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ОтветственныйПриИзмененииЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, СтрокаВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		НоваяНастройкаДоступности = Объект.НастройкиДоступности.Добавить();
		НоваяНастройкаДоступности.Пользователь = Объект.Ответственный;
		НоваяНастройкаДоступности.ВариантОтображения = Объект.ВариантОтображенияПоУмолчанию;
	КонецЕсли;
	
	УстановитьНадписиНастроекДоступностиИОтчетов(Объект, Элементы);
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьРасчетаПоказателяПриИзменении(Элемент)
	УстановитьНадписиКПолямПериодов(Объект, Элементы);
КонецПроцедуры

&НаКлиенте
Процедура РассчитыватьПрогнозПриИзменении(Элемент)
	УстановитьДоступностьЭлементовПрогнозированияФормы(Элементы, Объект.РассчитыватьПрогноз);
КонецПроцедуры

&НаКлиенте
Процедура ТипАнализаПриИзменении(Элемент)
	УстановитьСписокВыбораТиповДиаграмм(СоответствиеТиповСравненияИТиповДиаграмм,
			Элементы.ТипДиаграммы.СписокВыбора,
			Объект.ТипАнализа);
	
	УстановитьВидимостьДоступностьЭлементовФормы(СоответствиеТиповСравненияИТиповДиаграмм,
			Объект,
			Элементы,
			ЭтаФорма);
	
	Объект.ТипДиаграммы = Элементы.ТипДиаграммы.СписокВыбора[0].Значение;
	
	УстановитьДоступностьЗаполненияПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура ТочностьРасчетаДробнойЧастиПриИзменении(Элемент)
	УстановитьНадписьЗнаковПослеЗапятой(Объект.ТочностьРасчетаДробнойЧасти, Элементы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьНаименованиеПоШаблону(Команда)
	ЭлементыНастроек = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	
	СтрокаПриОтборах = "";
	Если ЕстьПользовательскиеНастройки(ЭлементыНастроек, Ложь) Тогда
		СтрокаПриОтборах = НСтр("ru='Установлены отборы'");
	КонецЕсли;
	
	ОтборПоТипуСравнения = Новый Структура("ТипАнализа", Объект.ТипАнализа);
	НайденныеПараметры = СоответствиеТиповСравненияИТиповДиаграмм.НайтиСтроки(ОтборПоТипуСравнения);
	ОбъектАнализаДоступен =  НайденныеПараметры[0].ОбъектАнализаДоступен;
	
	ПараметрВалютаРасчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек.ПользовательскиеНастройки,
		"ВалютаРасчета");
	
	Если ПараметрВалютаРасчета = Неопределено Тогда
		Наименование = Строка(Элементы.ЗначениеАнализа.ТекстРедактирования);
	Иначе
		Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 (%2)'"),
			Строка(Элементы.ЗначениеАнализа.ТекстРедактирования),
			ПараметрВалютаРасчета.Значение);
	КонецЕсли;
	Если ОбъектАнализаДоступен Тогда
		Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 по %2'"),
			Наименование,
			Строка(Элементы.ОбъектАнализа.ТекстРедактирования));
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтрокаПриОтборах) Тогда
		Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1, %2, %3'"),
			Наименование,
			Строка(Объект.МетодРасчетаЗначений),
			СтрокаПриОтборах);
	Иначе
		Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1, %2'"),
			Наименование,
			Строка(Объект.МетодРасчетаЗначений));
	КонецЕсли;
	Объект.Наименование = Наименование;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступность(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Пользователи", Объект.НастройкиДоступности);
	ПараметрыФормы.Вставить("ВариантОтображенияПоУмолчанию", Объект.ВариантОтображенияПоУмолчанию);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьДоступностьЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВариантыАнализаЦелевыхПоказателей.Форма.НастройкаДоступности",
		ПараметрыФормы,,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ЗаполнитьНастройкиДоступности(Результат);
		
		УстановитьНадписиНастроекДоступностиИОтчетов(Объект, Элементы);
		
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	// Открыть редактор настроек схемы компоновки данных
	Адреса = АдресаСхемыКомпоновкиДанныхИНастроекВоВременномХранилище();
	АдресПользовательскихНастроек = ПоместитьВоВременноеХранилище(КомпоновщикНастроек.ПользовательскиеНастройки, УникальныйИдентификатор);
	
	ПараметрыФормы = Новый Структура("АдресаСхемыКомпоновкиДанных, АдресПользовательскихНастроек", Адреса, АдресПользовательскихНастроек);
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьОтборыЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВариантыАнализаЦелевыхПоказателей.Форма.НастройкаОтборов",
		ПараметрыФормы,,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	АдресПользовательскихНастроек = Результат;
	
	Если Не АдресПользовательскихНастроек = Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПолучитьИзВременногоХранилища(АдресПользовательскихНастроек));
	КонецЕсли;
	
	УстановитьНадписиНастроекОтборовИУпорядочивания(КомпоновщикНастроек, Элементы);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтчеты(Команда)
	ПараметрыФормы  = Новый Структура("ВариантыОтчетов", Объект.ОтчетыДляРасшифровки);
	
	ОткрытьФорму("Справочник.ВариантыАнализаЦелевыхПоказателей.Форма.НастройкаОтчетовДляРасшифровки",
		ПараметрыФормы,,,,, 
		Новый ОписаниеОповещения("НастроитьОтчетыЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтчетыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ЗаполнитьНастройкиОтчетовДляРасшифровки(Результат);
		
		УстановитьНадписиНастроекДоступностиИОтчетов(Объект, Элементы);
		
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОформление(Команда)
	
	СтруктураНастроекОформления = Новый Структура;
	СтруктураНастроекОформления.Вставить("ОформлениеПокомпонентногоСравненияДоступно");
	СтруктураНастроекОформления.Вставить("ПрогнозированиеДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерыТочекДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерТочекПрогнозаДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьПодписиКДиаграммамДоступно");
	СтруктураНастроекОформления.Вставить("ОкантовкаДиаграммДоступно");
	СтруктураНастроекОформления.Вставить("РежимСглаживанияДиаграммДоступно");
	
	СтруктураНастроекОформления.Вставить("ХранилищеНастроекОформления", 
		ХранилищеНастроекОформления);
	СтруктураНастроекОформления.Вставить("ТолькоЦветОсновнойСерии", 
		Объект.ТолькоЦветОсновнойСерии);
	СтруктураНастроекОформления.Вставить("ГрадиентДляПокомпонентногоСравнения", 
		Объект.ГрадиентДляПокомпонентногоСравнения);
	СтруктураНастроекОформления.Вставить("ВыделятьМаксимальноеЗначениеДляПокомпонентногоСравнения", 
		Объект.ВыделятьМаксимальноеЗначениеДляПокомпонентногоСравнения);
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерыТочек", 
		Объект.ВыводитьМаркерыТочек);
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерТочекПрогноза", 
		Объект.ВыводитьМаркерТочекПрогноза);
	СтруктураНастроекОформления.Вставить("ОтображатьЛегенду", 
		Объект.ОтображатьЛегенду);
	СтруктураНастроекОформления.Вставить("ВыводитьПодписиКДиаграммам", 
		Объект.ВыводитьПодписиКДиаграммам);
	СтруктураНастроекОформления.Вставить("ОкантовкаДиаграмм", 
		Объект.ОкантовкаДиаграмм);
	СтруктураНастроекОформления.Вставить("РежимСглаживанияДиаграмм", 
		Объект.РежимСглаживанияДиаграмм);
	СтруктураНастроекОформления.Вставить("РежимШкалыЗначений", 
		Объект.РежимШкалыЗначений);
	СтруктураНастроекОформления.Вставить("ВключатьНоль", 
		Объект.ВключатьНоль);
		
	ЗаполнитьЗначенияСвойств(СтруктураНастроекОформления, 
		НастройкиПоТипуАнализаИДиаграммы(Объект, СоответствиеТиповСравненияИТиповДиаграмм));
	
	ПараметрыФормы = Новый Структура("СтруктураНастроекОформления", СтруктураНастроекОформления);
	
	ОткрытьФорму("Справочник.ВариантыАнализаЦелевыхПоказателей.Форма.НастройкаОформления",
		ПараметрыФормы,,,,,
		Новый ОписаниеОповещения("НастроитьОформлениеЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОформлениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, Результат);
		
		ХранилищеНастроекОформления = Результат.ХранилищеНастроекОформления;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УказатьДемоДанные(Команда)
	Если ПроверитьЗаполнение() Тогда
		СтруктураНастроекДемоДанных = СтруктураНастроекДемоДанных();
		
		Если СтруктураНастроекДемоДанных.НастройкиТребующиеОбновления.ТребуетсяОбновление Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтотОбъект, СтруктураНастроекДемоДанных);
			ТекстВопроса = НСтр("ru= 'С момента сохранения демонстрационных данных настройки изменились.
				| Продолжить с потерей демонстрационных данных?'");
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ПараметрыФормы = Новый Структура("СтруктураНастроекДемоДанных", СтруктураНастроекДемоДанных);
			ОписаниеОповещения = Новый ОписаниеОповещения("УказатьДемоДанныеЗавершение", ЭтотОбъект);
			ОткрытьФорму("Справочник.ВариантыАнализаЦелевыхПоказателей.Форма.НастройкаДемоДанных",
				ПараметрыФормы,,,,, 
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ПоказатьВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		ПараметрыФормы = Новый Структура("СтруктураНастроекДемоДанных", ДополнительныеПараметры);
		
		ОткрытьФорму("Справочник.ВариантыАнализаЦелевыхПоказателей.Форма.НастройкаДемоДанных",
			ПараметрыФормы,,,,, 
			Новый ОписаниеОповещения("УказатьДемоДанныеЗавершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Функция СтруктураНастроекДемоДанных()
	ДоступныеТипыДиаграмм = Новый СписокЗначений;
	УстановитьСписокВыбораТиповДиаграмм(СоответствиеТиповСравненияИТиповДиаграмм,
		ДоступныеТипыДиаграмм, Объект.ТипАнализа);
	ДоступныеОбъектыАнализа = Справочники.СтруктураЦелей.ДоступныеОбъектыАнализа(Объект.Владелец);
	ДоступныеЗначенияАнализа = Справочники.СтруктураЦелей.ДоступныеЗначенияАнализа(Объект.Владелец);
	ДоступныеПоляВыбора = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора;
	ДоступныеПоляГруппировок = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок;
	
	ЗначениеАнализаПолеКД = Новый ПолеКомпоновкиДанных(ЗначениеАнализа);
	Если ДоступныеЗначенияАнализа.НайтиПоЗначению(ЗначениеАнализаПолеКД) <> Неопределено Тогда
		ДоступноеПоле = ДоступныеПоляВыбора.НайтиПоле(ЗначениеАнализаПолеКД);
		ЗначениеАнализаЗаголовок = ДоступноеПоле.Заголовок;
	Иначе
		ЗначениеАнализаЗаголовок = "";
	КонецЕсли;
	ЗначениеАнализаДополнительноеПолеКД = Новый ПолеКомпоновкиДанных(ЗначениеАнализаДополнительное);
	Если ДоступныеЗначенияАнализа.НайтиПоЗначению(ЗначениеАнализаДополнительноеПолеКД) <> Неопределено Тогда
		ДоступноеПоле = ДоступныеПоляВыбора.НайтиПоле(ЗначениеАнализаДополнительноеПолеКД);
		ЗначениеАнализаДополнительноеЗаголовок = ДоступноеПоле.Заголовок;
	Иначе
		ЗначениеАнализаДополнительноеЗаголовок = "";
	КонецЕсли;
	ОбъектАнализаПолеКД = Новый ПолеКомпоновкиДанных(ОбъектАнализа);
	Если ДоступныеОбъектыАнализа.НайтиПоЗначению(ОбъектАнализаПолеКД) <> Неопределено Тогда
		ДоступноеПоле = ДоступныеПоляГруппировок.НайтиПоле(ОбъектАнализаПолеКД);
		ОбъектАнализаЗаголовок = ДоступноеПоле.Заголовок;
		ОбъектАнализаТипЗначения = ДоступноеПоле.ТипЗначения;
	Иначе
		ОбъектАнализаЗаголовок = "";
	КонецЕсли;
	
	СтруктураНастроекДемоДанных = Новый Структура;
	
	СтруктураНастроекДемоДанных.Вставить("СтруктураНастроекОформления");
	СтруктураНастроекДемоДанных.Вставить("НастройкиТребующиеОбновления");
	
	СтруктураНастроекДемоДанных.Вставить("ВариантАнализа", 
		Объект.Ссылка);
	СтруктураНастроекДемоДанных.Вставить("ЗначениеАнализа", 
		ЗначениеАнализа);
	СтруктураНастроекДемоДанных.Вставить("ЗначениеАнализаОписаниеТипа", 
		ОбщегоНазначения.ОписаниеТипаЧисло(15, Объект.ТочностьРасчетаДробнойЧасти));
	СтруктураНастроекДемоДанных.Вставить("ЗначениеАнализаЗаголовок", 
		ЗначениеАнализаЗаголовок);
	СтруктураНастроекДемоДанных.Вставить("ЗначениеАнализаДополнительное", 
		ЗначениеАнализаДополнительное);
	СтруктураНастроекДемоДанных.Вставить("ЗначениеАнализаДополнительноеОписаниеТипа", 
		ОбщегоНазначения.ОписаниеТипаЧисло(15, Объект.ТочностьРасчетаДробнойЧасти));
	СтруктураНастроекДемоДанных.Вставить("ЗначениеАнализаДополнительноеЗаголовок", 
		ЗначениеАнализаДополнительноеЗаголовок);
	СтруктураНастроекДемоДанных.Вставить("ОбъектАнализа", 
		ОбъектАнализа);
	СтруктураНастроекДемоДанных.Вставить("ОбъектАнализаОписаниеТипа", 
		ОбъектАнализаТипЗначения);
	СтруктураНастроекДемоДанных.Вставить("ОбъектАнализаЗаголовок", 
		ОбъектАнализаЗаголовок);
	СтруктураНастроекДемоДанных.Вставить("РежимПокомпонентногоСравнения", 
		Объект.РежимПокомпонентногоСравнения);
	СтруктураНастроекДемоДанных.Вставить("ТипДиаграммы", 
		Объект.ТипДиаграммы);
	СтруктураНастроекДемоДанных.Вставить("ДоступныеТипыДиаграмм", 
		ДоступныеТипыДиаграмм.ВыгрузитьЗначения());
	СтруктураНастроекДемоДанных.Вставить("ХранилищеДемонстрационныхДанных", 
		ХранилищеДемонстрационныхДанных);
	СтруктураНастроекДемоДанных.Вставить("ХранилищеПользовательскихНастроекКомпоновкиДанных", 
		ХранилищеПользовательскихНастроекКомпоновкиДанных);
		
	СтруктураНастроекОформления = Новый Структура;
	СтруктураНастроекОформления.Вставить("ОформлениеПокомпонентногоСравненияДоступно");
	СтруктураНастроекОформления.Вставить("ПрогнозированиеДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерыТочекДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерТочекПрогнозаДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьПодписиКДиаграммамДоступно");
	СтруктураНастроекОформления.Вставить("ОкантовкаДиаграммДоступно");
	СтруктураНастроекОформления.Вставить("РежимСглаживанияДиаграммДоступно");
	
	СтруктураНастроекОформления.Вставить("ХранилищеНастроекОформления", ХранилищеНастроекОформления); 
	СтруктураНастроекОформления.Вставить("ТолькоЦветОсновнойСерии", Объект.ТолькоЦветОсновнойСерии);
	СтруктураНастроекОформления.Вставить("ГрадиентДляПокомпонентногоСравнения", Объект.ГрадиентДляПокомпонентногоСравнения);
	СтруктураНастроекОформления.Вставить("ВыделятьМаксимальноеЗначениеДляПокомпонентногоСравнения", 
		Объект.ВыделятьМаксимальноеЗначениеДляПокомпонентногоСравнения);
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерыТочек", Объект.ВыводитьМаркерыТочек);
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерТочекПрогноза", Объект.ВыводитьМаркерТочекПрогноза);
	СтруктураНастроекОформления.Вставить("ОтображатьЛегенду", Объект.ОтображатьЛегенду);
	СтруктураНастроекОформления.Вставить("ВыводитьПодписиКДиаграммам", Объект.ВыводитьПодписиКДиаграммам);
	СтруктураНастроекОформления.Вставить("ОкантовкаДиаграмм", Объект.ОкантовкаДиаграмм);
	СтруктураНастроекОформления.Вставить("РежимСглаживанияДиаграмм", Объект.РежимСглаживанияДиаграмм);
	СтруктураНастроекОформления.Вставить("РежимШкалыЗначений", Объект.РежимШкалыЗначений);
	СтруктураНастроекОформления.Вставить("ВключатьНоль", Объект.ВключатьНоль);
		
	ЗаполнитьЗначенияСвойств(СтруктураНастроекОформления, 
		НастройкиПоТипуАнализаИДиаграммы(Объект, СоответствиеТиповСравненияИТиповДиаграмм));
	
	СтруктураНастроекДемоДанных.Вставить("СтруктураНастроекОформления", СтруктураНастроекОформления);
		
	НастройкиТребующиеОбновления = Новый Структура;
	НастройкиТребующиеОбновления.Вставить("ТребуетсяОбновление", Ложь);
	НастройкиТребующиеОбновления.Вставить("ТипАнализа", Объект.ТипАнализа);
	НастройкиТребующиеОбновления.Вставить("ПериодАнализа", ПериодАнализа);
	НастройкиТребующиеОбновления.Вставить("ПериодСравнения", ПериодСравнения);
	НастройкиТребующиеОбновления.Вставить("ПериодичностьРасчетаПоказателя", Объект.ПериодичностьРасчетаПоказателя);
	НастройкиТребующиеОбновления.Вставить("РежимПокомпонентногоСравнения", Объект.РежимПокомпонентногоСравнения);
	НастройкиТребующиеОбновления.Вставить("КратностьЗначений", Объект.КратностьЗначений);
	НастройкиТребующиеОбновления.Вставить("ТочностьРасчетаДробнойЧасти", Объект.ТочностьРасчетаДробнойЧасти);
	НастройкиТребующиеОбновления.Вставить("ОбъектАнализа", ОбъектАнализа);
	НастройкиТребующиеОбновления.Вставить("ЗначениеАнализа", ЗначениеАнализа);
	НастройкиТребующиеОбновления.Вставить("ЗначениеАнализаДополнительное", ЗначениеАнализаДополнительное);
		
	ХранилищеДемонстрационныхДанныхВрем = ХранилищеДемонстрационныхДанных; // ХранилищеЗначения
	ХранилищеДемонстрационныхДанныхЗначение = ХранилищеДемонстрационныхДанныхВрем.Получить();
	Если ХранилищеДемонстрационныхДанныхЗначение <> Неопределено Тогда
		ХранилищеДемонстрационныхДанныхЗначение.Настройки.Вставить("ТребуетсяОбновление", Ложь);
		ТребуетсяОбновление = Не ОбщегоНазначения.ДанныеСовпадают(ХранилищеДемонстрационныхДанныхЗначение.Настройки, 
			НастройкиТребующиеОбновления);
		НастройкиТребующиеОбновления.Вставить("ТребуетсяОбновление", ТребуетсяОбновление);
	КонецЕсли;
		
	СтруктураНастроекДемоДанных.Вставить("НастройкиТребующиеОбновления", НастройкиТребующиеОбновления);
	
	Возврат СтруктураНастроекДемоДанных;
КонецФункции

&НаКлиенте
Процедура УказатьДемоДанныеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, Результат);
		ЗаполнитьЗначенияСвойств(Объект, Результат.СтруктураНастроекОформления);
		
		Модифицированность = Результат.Модифицированность;
		ХранилищеНастроекОформления = Результат.СтруктураНастроекОформления.ХранилищеНастроекОформления;
		ХранилищеДемонстрационныхДанных = Результат.ХранилищеДемонстрационныхДанных;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
КонецПроцедуры
// Конец МенюОтчеты

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПриИзмененииРеквизитов

&НаКлиенте 
Процедура УстановитьДоступностьЗаполненияПоШаблону()
	ОтборПоТипуСравнения = Новый Структура("ТипАнализа", Объект.ТипАнализа);
	НайденныеПараметры = СоответствиеТиповСравненияИТиповДиаграмм.НайтиСтроки(ОтборПоТипуСравнения);
	
	Если ЗначениеЗаполнено(Объект.ТипАнализа)
		И ЗначениеЗаполнено(ЗначениеАнализа)
		И НЕ Элементы.ЗначениеАнализа.СписокВыбора.НайтиПоЗначению(ЗначениеАнализа) = Неопределено
		И ЗначениеЗаполнено(Объект.МетодРасчетаЗначений) Тогда
		
		Если НайденныеПараметры[0].ОбъектАнализаДоступен Тогда
			Если НЕ ОбъектАнализа = Неопределено
				И НЕ Элементы.ОбъектАнализа.СписокВыбора.НайтиПоЗначению(ОбъектАнализа) = Неопределено Тогда
				Элементы.ЗаполнитьНаименованиеПоШаблону.Доступность = Истина;
				
			Иначе
				Элементы.ЗаполнитьНаименованиеПоШаблону.Доступность = Ложь;
			КонецЕсли;
		Иначе 
			Элементы.ЗаполнитьНаименованиеПоШаблону.Доступность = Истина;
		КонецЕсли;
	Иначе
		Элементы.ЗаполнитьНаименованиеПоШаблону.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьДоступностьЭлементовПрогнозированияФормы(Элементы, РассчитыватьПрогноз)
	Элементы.ГлубинаАнализаПрогноза.Доступность = РассчитыватьПрогноз;
	Элементы.ГоризонтПрогноза.Доступность = РассчитыватьПрогноз;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьВидимостьДоступностьЭлементовФормы(ТипыСравненияИТипыДиаграмм, Объект, Элементы, ЭтаФорма)
	НастройкиПоТипуАнализа = НастройкиПоТипуАнализа(Объект, ЭтаФорма.СоответствиеТиповСравненияИТиповДиаграмм);
	
	Элементы.ПериодСравнения.Видимость = НастройкиПоТипуАнализа.ПериодСравненияДоступен;
	Элементы.ПериодСравнения.АвтоОтметкаНезаполненного = НастройкиПоТипуАнализа.ПериодСравненияДоступен;
	
	Элементы.ГруппаПрогнозирование.Доступность = НастройкиПоТипуАнализа.ПрогнозированиеДоступно;
	
	Элементы.ГлубинаАнализаПрогноза.Доступность = Объект.РассчитыватьПрогноз;
	Элементы.ГоризонтПрогноза.Доступность = Объект.РассчитыватьПрогноз;
	
	Элементы.МетодРасчетаЗначений.Доступность = ЭтаФорма.НарастающийИтогДоступен;
	
	Элементы.ГруппаРежимПокомпонентногоСравнения.Видимость = НастройкиПоТипуАнализа.ОбъектАнализаДоступен;
	Элементы.РежимПокомпонентногоСравнения.Видимость = ЭтаФорма.ЗначениеАнализаДополнительноеВыборВозможен;
	Элементы.ОбъектАнализа.АвтоОтметкаНезаполненного = НастройкиПоТипуАнализа.ОбъектАнализаДоступен;
	Элементы.ЗначениеАнализаДополнительное.АвтоОтметкаНезаполненного = НастройкиПоТипуАнализа.ОбъектАнализаДоступен;
	
	УстановитьВидимостьДоступностьЭлементовСравнения(Объект, Элементы, НастройкиПоТипуАнализа.ОбъектАнализаДоступен);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступностьЭлементовСравнения(Знач Объект, Знач Элементы, ОбъектАнализаДоступен)
	Если Объект.РежимПокомпонентногоСравнения = 0 Тогда
		Элементы.ОбъектАнализа.Видимость = Истина;
		Элементы.ЗначениеАнализаДополнительное.Видимость = Ложь;
		Элементы.ОбъектАнализа.АвтоОтметкаНезаполненного = ОбъектАнализаДоступен;
		Элементы.ЗначениеАнализаДополнительное.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ОбъектАнализа.Видимость = Ложь;
		Элементы.ЗначениеАнализаДополнительное.Видимость = Истина;
		Элементы.ОбъектАнализа.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ЗначениеАнализаДополнительное.АвтоОтметкаНезаполненного = ОбъектАнализаДоступен;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьНадписьЗнаковПослеЗапятой(ЗнаковПослеЗапятой, Элементы)
	ЕдЧислоИменительный = НСтр("ru='знак'");
	ЕдЧислоРодительный = НСтр("ru='знака'");
	МнЧислоРодительный = НСтр("ru='знаков'");
	ЧастьЗаголовка = ОбщегоНазначенияУТКлиентСервер.СклонениеСлова(
		ЗнаковПослеЗапятой, 
		ЕдЧислоИменительный,
		ЕдЧислоРодительный,
		МнЧислоРодительный,
		"м");
	Элементы.НадписьЗнаковПослеЗапятой.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='%1 после запятой'"),
		ЧастьЗаголовка);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьНадписиКПолямПериодов(Объект, Элементы)
	Элементы.НадписьГлубинаАнализаПрогноза.Заголовок = МониторингЦелевыхПоказателейКлиентСервер.ПериодПрописью(Объект.ГлубинаАнализаПрогноза, Объект.ПериодичностьРасчетаПоказателя);
	Элементы.НадписьГоризонтПрогноза.Заголовок = МониторингЦелевыхПоказателейКлиентСервер.ПериодПрописью(Объект.ГоризонтПрогноза, Объект.ПериодичностьРасчетаПоказателя);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьНадписиНастроекДоступностиИОтчетов(Объект, Элементы)
	Если Объект.НастройкиДоступности.Количество() = 0 Тогда
		Элементы.НастроитьДоступность.Заголовок = НСтр("ru='настроить доступность'");
	Иначе
		Элементы.НастроитьДоступность.Заголовок = НСтр("ru='изменить доступность'");
	КонецЕсли;
	
	Если Объект.ОтчетыДляРасшифровки.Количество() = 0 Тогда
		Элементы.НастроитьОтчеты.Заголовок = НСтр("ru='настроить отчеты'");
	Иначе
		Элементы.НастроитьОтчеты.Заголовок = НСтр("ru='изменить отчеты'");
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьНадписиНастроекОтборовИУпорядочивания(КомпоновщикНастроек, Элементы)
	ЭлементыНастроек = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	
	Если ЕстьПользовательскиеНастройки(ЭлементыНастроек) Тогда
		Элементы.НастроитьОтборыИУпорядочивание.Заголовок = НСтр("ru='посмотреть / изменить'");
	Иначе
		Элементы.НастроитьОтборыИУпорядочивание.Заголовок = НСтр("ru='настроить'");
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьСписокВыбораТиповДиаграмм(ТипыСравненияИТипыДиаграмм, СписокВыбора, ТипАнализа)
	СписокВыбора.Очистить();
	
	ОтборПоТипуСравнения = Новый Структура("ТипАнализа", ТипАнализа);
	НайденныеТипыДиаграмм = ТипыСравненияИТипыДиаграмм.НайтиСтроки(ОтборПоТипуСравнения);
	
	Для Каждого ТекНайденныйТипДиаграммы Из НайденныеТипыДиаграмм Цикл 
		СписокВыбора.Добавить(ТекНайденныйТипДиаграммы.ТипДиаграммы);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере 
Функция АдресаСхемыКомпоновкиДанныхИНастроекВоВременномХранилище()
	Возврат Справочники.СтруктураЦелей.АдресаСхемыКомпоновкиДанныхИНастроекВоВременномХранилище(Объект.Владелец);
КонецФункции

&НаСервере 
Процедура ВосстановитьНастройкиСКДВариантаАнализа()
	ВариантАнализаОбъект = РеквизитФормыВЗначение("Объект");
	ДоступныеОбъектыАнализа = Справочники.СтруктураЦелей.ДоступныеОбъектыАнализа(Объект.Владелец);
	ДоступныеЗначенияАнализа = Справочники.СтруктураЦелей.ДоступныеЗначенияАнализа(Объект.Владелец);
	
	Если Параметры.Свойство("ЗначениеКопирования") И НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
		ХранилищеПользовательскихНастроекКомпоновкиДанных = Параметры.ЗначениеКопирования.ХранилищеПользовательскихНастроекКомпоновкиДанных;
		ОбъектАнализа = Параметры.ЗначениеКопирования.ОбъектАнализа.Получить();
		ЗначениеАнализа = Параметры.ЗначениеКопирования.ЗначениеАнализа.Получить();
		ЗначениеАнализаДополнительное = Параметры.ЗначениеКопирования.ЗначениеАнализаДополнительное.Получить();
	Иначе	
		ХранилищеПользовательскихНастроекКомпоновкиДанных = ВариантАнализаОбъект.ХранилищеПользовательскихНастроекКомпоновкиДанных;
		Если ОбъектАнализа = Неопределено Тогда
			ОбъектАнализаСохраненный = ВариантАнализаОбъект.ОбъектАнализа.Получить();
			Если ДоступныеОбъектыАнализа.НайтиПоЗначению(ОбъектАнализаСохраненный) <> Неопределено Тогда
				ОбъектАнализа = ОбъектАнализаСохраненный;
			Иначе
				ВариантАнализаОбъект.ОбъектАнализа = Новый ХранилищеЗначения(Неопределено);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеАнализа = Неопределено Тогда
			ЗначениеАнализаСохраненное = ВариантАнализаОбъект.ЗначениеАнализа.Получить();
			Если ДоступныеЗначенияАнализа.НайтиПоЗначению(ЗначениеАнализаСохраненное) <> Неопределено Тогда
				ЗначениеАнализа = ЗначениеАнализаСохраненное;
			Иначе
				ВариантАнализаОбъект.ЗначениеАнализа = Новый ХранилищеЗначения(Неопределено);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеАнализаДополнительное = Неопределено Тогда
			ЗначениеАнализаДополнительноеСохраненное = ВариантАнализаОбъект.ЗначениеАнализаДополнительное.Получить();
			Если ДоступныеЗначенияАнализа.НайтиПоЗначению(ЗначениеАнализаДополнительноеСохраненное) <> Неопределено Тогда
				ЗначениеАнализаДополнительное = ЗначениеАнализаДополнительноеСохраненное;
			Иначе
				ВариантАнализаОбъект.ЗначениеАнализаДополнительное = Новый ХранилищеЗначения(Неопределено);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ОбъектАнализа   = Строка(ОбъектАнализа);
	ЗначениеАнализа = Строка(ЗначениеАнализа);
	ЗначениеАнализаДополнительное = Строка(ЗначениеАнализаДополнительное);
	
	Адреса = АдресаСхемыКомпоновкиДанныхИНастроекВоВременномХранилище();
	
	Если НЕ Адреса.СхемаКомпоновкиДанных = Неопределено Тогда
		Схема = ПолучитьИзВременногоХранилища(Адреса.СхемаКомпоновкиДанных);
		ХранилищеСхемыКомпоновкиДанных = Новый ХранилищеЗначения(Схема);
		
		Если НЕ Адреса.НастройкиКомпоновкиДанных = Неопределено Тогда
			НастройкиКомпоновкиДанных = ПолучитьИзВременногоХранилища(Адреса.НастройкиКомпоновкиДанных);
			
			ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(НастройкиКомпоновкиДанных);
		Иначе
			ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(Схема.НастройкиПоУмолчанию);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Схема.Параметры.Найти("НарастающимИтогом") = Неопределено Тогда
		НарастающийИтогДоступен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура ВосстановитьПериодАнализаСервер()
	ВариантАнализаОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Параметры.Свойство("ЗначениеКопирования") И НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
		ПериодАнализа = Параметры.ЗначениеКопирования.ПериодАнализа.Получить();
	Иначе
		ПериодАнализа = ВариантАнализаОбъект.ПериодАнализа.Получить();
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура ВосстановитьПериодСравненияСервер()
	ВариантАнализаОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Параметры.Свойство("ЗначениеКопирования") И НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
		ПериодСравнения = Параметры.ЗначениеКопирования.ПериодСравнения.Получить();
	Иначе
		ПериодСравнения = ВариантАнализаОбъект.ПериодСравнения.Получить();
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция ЕстьПользовательскиеНастройки(ПользовательскиеНастройкиЭлементы, УчитыватьПараметры = Истина)
	ЕстьИспользование = Ложь;
	
	Для Каждого ЭлементНастроек Из ПользовательскиеНастройкиЭлементы Цикл 
		Если ТипЗнч(ЭлементНастроек) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") 
			И НЕ УчитыватьПараметры Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементНастроек.Использование Тогда
			ЕстьИспользование = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьИспользование;
КонецФункции

&НаСервере 
Процедура ИнициализироватьДанныеФормы()
	ИнициализироватьКомпоновщикНастроек();
	
	ЗаполнитьСписокВыбораОбъектовАнализа();
	
	ЗаполнитьСписокВыбораЗначенийАнализа();
	
	Если Объект.ВариантОтображенияПоУмолчанию.Пустая() Тогда
		Объект.ВариантОтображенияПоУмолчанию = Перечисления.ВариантыОтображенияВариантовАнализа.Диаграмма;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура ИнициализироватьКомпоновщикНастроек()
	
	ХранилищеСхемыКомпоновкиДанныхВрем = ХранилищеСхемыКомпоновкиДанных; // ХранилищеЗначения
	СКДВариантаАнализа = ХранилищеСхемыКомпоновкиДанныхВрем.Получить();
	
	АдресСКД = ПоместитьВоВременноеХранилище(СКДВариантаАнализа, Новый УникальныйИдентификатор());
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД);
	
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	ХранилищеНастроекКомпоновкиДанныхВрем = ХранилищеНастроекКомпоновкиДанных; // ХранилищеЗначения
	
	Если НЕ ХранилищеНастроекКомпоновкиДанных = Неопределено И НЕ ХранилищеНастроекКомпоновкиДанныхВрем.Получить() = Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(ХранилищеНастроекКомпоновкиДанныхВрем.Получить());
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(СКДВариантаАнализа.НастройкиПоУмолчанию);
	КонецЕсли;
	
	ХранилищеПользовательскихНастроекКомпоновкиДанныхВрем = ХранилищеПользовательскихНастроекКомпоновкиДанных; // ХранилищеЗначения
	
	Если НЕ ХранилищеПользовательскихНастроекКомпоновкиДанныхВрем.Получить() = Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ХранилищеПользовательскихНастроекКомпоновкиДанныхВрем.Получить());
	КонецЕсли;
	
	// Заполним обязательный параметр ВалютРасчета для СКД где он есть и не заполнен
	ПараметрВалютаРасчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек.ПользовательскиеНастройки, "ВалютаРасчета");
	Если НЕ ПараметрВалютаРасчета = Неопределено
	   И ПараметрВалютаРасчета.Значение = Справочники.Валюты.ПустаяСсылка() Тогда
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.ПользовательскиеНастройки,
			"ВалютаРасчета",
			МониторингЦелевыхПоказателей.ПолучитьВалютуПоУмолчанию(),
			Истина);
	КонецЕсли;
КонецПроцедуры


// Возвращает таблицу доступности.
// 
// Параметры:
// 	ХранилищеТаблицыДоступности - ХранилищеЗначения - 
// Возвращаемое значение:
// 	ТаблицаЗначений - с колонкой:
// 	 *Доступность - Булево - флаг доступности.
&НаСервере
Функция ТаблицаДоступностиИзХранилищаЗначений(ХранилищеТаблицыДоступности)
	ТаблицаДоступности = ХранилищеТаблицыДоступности.Получить();
	Возврат ТаблицаДоступности;
КонецФункции

&НаСервере 
Процедура ЗаполнитьНастройкиДоступности(АдресНастроекДоступности)
	ХранилищеТаблицыДоступности = ПолучитьИзВременногоХранилища(АдресНастроекДоступности);
	
	Если НЕ ХранилищеТаблицыДоступности = Неопределено Тогда
		ТаблицаДоступности = ТаблицаДоступностиИзХранилищаЗначений(ХранилищеТаблицыДоступности);
		
		НастройкиДоступности = Объект.НастройкиДоступности;
		НастройкиДоступности.Очистить();
		Для Каждого СтрокаДоступности Из ТаблицаДоступности Цикл 
			Если НЕ СтрокаДоступности.Доступность Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = НастройкиДоступности.Добавить();
			НоваяСтрока.Пользователь = СтрокаДоступности.Пользователь;
			НоваяСтрока.ВариантОтображения = СтрокаДоступности.ВариантОтображения;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Возвращает таблицу отчетов.
// 
// Параметры:
// 	ХранилищеТаблицыОтчетов - ХранилищеЗначения - 
// Возвращаемое значение:
// 	ТаблицаЗначений - с колонкой:
// 	 *Доступность - Булево - флаг доступности.
&НаСервере
Функция ТаблицаОтчетовИзХранилищаЗначений(ХранилищеТаблицыОтчетов)
	ТаблицаОтчетов = ХранилищеТаблицыОтчетов.Получить();
	Возврат ТаблицаОтчетов;
КонецФункции

&НаСервере 
Процедура ЗаполнитьНастройкиОтчетовДляРасшифровки(АдресНастроекОтчетов)
	ХранилищеТаблицыОтчетов = ПолучитьИзВременногоХранилища(АдресНастроекОтчетов);
	
	Если НЕ ХранилищеТаблицыОтчетов = Неопределено Тогда
		ТаблицаОтчетов = ТаблицаОтчетовИзХранилищаЗначений(ХранилищеТаблицыОтчетов);
		
		ОтчетыДляРасшифровки = Объект.ОтчетыДляРасшифровки;
		ОтчетыДляРасшифровки.Очистить();
		Для Каждого СтрокаОтчет Из ТаблицаОтчетов Цикл 
			Если НЕ СтрокаОтчет.Доступность Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ОтчетыДляРасшифровки.Добавить();
			НоваяСтрока.ВариантОтчета = СтрокаОтчет.ВариантОтчета;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьОбъектИЗначениеАнализаПоУмолчанию()
	ДоступныеОбъектыАнализа = Справочники.СтруктураЦелей.ДоступныеОбъектыАнализа(Объект.Владелец);
	ДоступныеЗначенияАнализа = Справочники.СтруктураЦелей.ДоступныеЗначенияАнализа(Объект.Владелец);
	
	ОбъектАнализа = ДоступныеОбъектыАнализа[0].Значение;
	ЗначениеАнализа = ДоступныеЗначенияАнализа[0].Значение;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСписокВыбораЗначенийАнализа()
	ДоступныеПоля = Справочники.СтруктураЦелей.ДоступныеЗначенияАнализа(Объект.Владелец);
	
	Элементы.ЗначениеАнализа.СписокВыбора.Очистить();
	Для Каждого ДоступноеПоле Из ДоступныеПоля Цикл 
		Элементы.ЗначениеАнализа.СписокВыбора.Добавить(Строка(ДоступноеПоле.Значение), ДоступноеПоле.Представление);
	КонецЦикла;
	
	Элементы.ЗначениеАнализаДополнительное.СписокВыбора.Очистить();
	Для Каждого ДоступноеПоле Из ДоступныеПоля Цикл
		Если Строка(ДоступноеПоле.Значение) = ЗначениеАнализа Тогда
			Продолжить;
		КонецЕсли;
		Элементы.ЗначениеАнализаДополнительное.СписокВыбора.Добавить(Строка(ДоступноеПоле.Значение), ДоступноеПоле.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСписокВыбораОбъектовАнализа()
	ДоступныеПоля = Справочники.СтруктураЦелей.ДоступныеОбъектыАнализа(Объект.Владелец);
	
	Элементы.ОбъектАнализа.СписокВыбора.Очистить();
	
	Для Каждого ДоступноеПоле Из ДоступныеПоля Цикл 
		Элементы.ОбъектАнализа.СписокВыбора.Добавить(Строка(ДоступноеПоле.Значение), ДоступноеПоле.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере 
Процедура ПриЧтенииСозданииНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ХранилищеНастроекОформления = Параметры.ЗначениеКопирования.ХранилищеНастроекОформления;
			ХранилищеДемонстрационныхДанных = Параметры.ЗначениеКопирования.ХранилищеДемонстрационныхДанных;
			ХранилищеПользовательскихНастроекКомпоновкиДанных = Параметры.ЗначениеКопирования.ХранилищеПользовательскихНастроекКомпоновкиДанных;
		Иначе
			УстановитьНастройкиОформленияПоУмолчанию();
			
			ЗаполнитьОбъектИЗначениеАнализаПоУмолчанию();
			
			ХранилищеДемонстрационныхДанных = Новый ХранилищеЗначения(Неопределено);
		КонецЕсли;
	Иначе
		ВариантАнализаОбъект = РеквизитФормыВЗначение("Объект");
		ХранилищеНастроекОформления = ВариантАнализаОбъект.ХранилищеНастроекОформления;
		ХранилищеДемонстрационныхДанных = ВариантАнализаОбъект.ХранилищеДемонстрационныхДанных;
	КонецЕсли;
	
	
	ЗначениеВДанныеФормы(МониторингЦелевыхПоказателей.ТипыАнализаИДиаграмм(), СоответствиеТиповСравненияИТиповДиаграмм);
	
	УстановитьСписокВыбораТиповДиаграмм(СоответствиеТиповСравненияИТиповДиаграмм,
			Элементы.ТипДиаграммы.СписокВыбора,
			Объект.ТипАнализа);
	
	УстановитьНадписиКПолямПериодов(Объект, Элементы);
	
	УстановитьНадписьЗнаковПослеЗапятой(Объект.ТочностьРасчетаДробнойЧасти, Элементы);
	
	ВосстановитьПериодАнализаСервер();
	
	ВосстановитьПериодСравненияСервер();

	ВосстановитьНастройкиСКДВариантаАнализа();
	
	ИнициализироватьДанныеФормы();
	
	УстановитьНадписиНастроекОтборовИУпорядочивания(КомпоновщикНастроек, Элементы);
	
	УстановитьНадписиНастроекДоступностиИОтчетов(Объект, Элементы);
	
	ОбъектАнализаВыборВозможен = Справочники.СтруктураЦелей.ДоступныеОбъектыАнализа(Объект.Владелец).Количество() > 0;
	ЗначениеАнализаДополнительноеВыборВозможен =
		Справочники.СтруктураЦелей.ДоступныеЗначенияАнализа(Объект.Владелец).Количество() > 1;
	
	УстановитьВидимостьДоступностьЭлементовФормы(СоответствиеТиповСравненияИТиповДиаграмм, Объект, Элементы, ЭтаФорма);
	
	УстановитьДоступностьЗаполненияПоШаблонуСервер();
КонецПроцедуры

&НаСервере 
Процедура СохранитьНастройкиСКДВариантаАнализа(ТекущийОбъект)
	Если ЗначениеЗаполнено(ОбъектАнализа) Тогда
		ТекущийОбъект.ОбъектАнализа = Новый ХранилищеЗначения(Новый ПолеКомпоновкиДанных(ОбъектАнализа));
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗначениеАнализа) Тогда
		ТекущийОбъект.ЗначениеАнализа = Новый ХранилищеЗначения(Новый ПолеКомпоновкиДанных(ЗначениеАнализа));
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗначениеАнализаДополнительное) Тогда
		ТекущийОбъект.ЗначениеАнализаДополнительное = Новый ХранилищеЗначения(Новый ПолеКомпоновкиДанных(ЗначениеАнализаДополнительное));
	КонецЕсли;
	ТекущийОбъект.ХранилищеПользовательскихНастроекКомпоновкиДанных = Новый ХранилищеЗначения(КомпоновщикНастроек.ПользовательскиеНастройки);
КонецПроцедуры

&НаСервере 
Процедура УстановитьНастройкиОформленияПоУмолчанию()
	СтруктураНастроекОформления = Справочники.ВариантыАнализаЦелевыхПоказателей.НастройкиОформленияПоУмолчанию();
	
	Если НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
		ХранилищеНастроекОформления = Параметры.ЗначениеКопирования.ХранилищеНастроекОформления;
	Иначе
		ХранилищеНастроекОформления = СтруктураНастроекОформления.ХранилищеНастроекОформления;
		ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроекОформления);
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура УстановитьДоступностьЗаполненияПоШаблонуСервер()
	ОтборПоТипуСравнения = Новый Структура("ТипАнализа", Объект.ТипАнализа);
	НайденныеПараметры = СоответствиеТиповСравненияИТиповДиаграмм.НайтиСтроки(ОтборПоТипуСравнения);
	
	Если ЗначениеЗаполнено(Объект.ТипАнализа) 
		И ЗначениеЗаполнено(ЗначениеАнализа)
		И ЗначениеЗаполнено(Объект.МетодРасчетаЗначений) Тогда
		
		Если НайденныеПараметры[0].ОбъектАнализаДоступен Тогда
			Если НЕ ОбъектАнализа = Неопределено Тогда
				Элементы.ЗаполнитьНаименованиеПоШаблону.Доступность = Истина;
			Иначе
				Элементы.ЗаполнитьНаименованиеПоШаблону.Доступность = Ложь;
			КонецЕсли;
		Иначе 
			Элементы.ЗаполнитьНаименованиеПоШаблону.Доступность = Истина;
		КонецЕсли;
		
		Элементы.ЗаполнитьНаименованиеПоШаблону.Доступность = Истина;
	Иначе
		Элементы.ЗаполнитьНаименованиеПоШаблону.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция НастройкиПоТипуАнализаИДиаграммы(ВариантАнализа, СоответствиеТиповСравненияИТиповДиаграмм)
	СтруктураНастроекОформления = Новый Структура;
	СтруктураНастроекОформления.Вставить("ТипАнализа");
	СтруктураНастроекОформления.Вставить("ТипДиаграммы");
	СтруктураНастроекОформления.Вставить("ПериодСравненияДоступен");
	СтруктураНастроекОформления.Вставить("ОбъектАнализаДоступен");
	СтруктураНастроекОформления.Вставить("ОформлениеПокомпонентногоСравненияДоступно");
	СтруктураНастроекОформления.Вставить("ПрогнозированиеДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерыТочекДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерТочекПрогнозаДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьПодписиКДиаграммамДоступно");
	СтруктураНастроекОформления.Вставить("ОкантовкаДиаграммДоступно");
	СтруктураНастроекОформления.Вставить("РежимСглаживанияДиаграммДоступно"); 

	ОтборПоТипуАнализаИДиаграммы = Новый Структура;
	ОтборПоТипуАнализаИДиаграммы.Вставить("ТипАнализа", ВариантАнализа.ТипАнализа);
	ОтборПоТипуАнализаИДиаграммы.Вставить("ТипДиаграммы", ВариантАнализа.ТипДиаграммы);
	НайденныеНастройки = СоответствиеТиповСравненияИТиповДиаграмм.НайтиСтроки(ОтборПоТипуАнализаИДиаграммы);
	ЗаполнитьЗначенияСвойств(СтруктураНастроекОформления, НайденныеНастройки[0]);
	
	Возврат СтруктураНастроекОформления;
КонецФункции

&НаКлиентеНаСервереБезКонтекста 
Функция НастройкиПоТипуАнализа(ВариантАнализа, СоответствиеТиповСравненияИТиповДиаграмм)
	СтруктураНастроекОформления  = Новый Структура;
	СтруктураНастроекОформления.Вставить("ТипАнализа");
	СтруктураНастроекОформления.Вставить("ТипДиаграммы");
	СтруктураНастроекОформления.Вставить("ПериодСравненияДоступен");
	СтруктураНастроекОформления.Вставить("ОбъектАнализаДоступен");
	СтруктураНастроекОформления.Вставить("ОформлениеПокомпонентногоСравненияДоступно");
	СтруктураНастроекОформления.Вставить("ПрогнозированиеДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерыТочекДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьМаркерТочекПрогнозаДоступно");
	СтруктураНастроекОформления.Вставить("ВыводитьПодписиКДиаграммамДоступно");
	СтруктураНастроекОформления.Вставить("ОкантовкаДиаграммДоступно");
	СтруктураНастроекОформления.Вставить("РежимСглаживанияДиаграммДоступно");
	
	ОтборПоТипуАнализа = Новый Структура("ТипАнализа", ВариантАнализа.ТипАнализа);
	НайденныеНастройки = СоответствиеТиповСравненияИТиповДиаграмм.НайтиСтроки(ОтборПоТипуАнализа);
	ЗаполнитьЗначенияСвойств(СтруктураНастроекОформления, НайденныеНастройки[0]);
	
	Возврат СтруктураНастроекОформления;
КонецФункции

// МенюОтчеты

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
